---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ElementTypeParameterized
source: html/66401cc9-599d-9b49-db7b-b7ceaa2407d8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ElementTypeParameterized Property

The type(s) of the selected element(s) are driven by family parameter(s). Changing the type directly will break the association.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementTypeParameterized { get; }
```